YCSB/ycsb_20251114_091134/rr_cpu_bound_run.log
/usr/bin/java  -classpath /home/ldy/src/YCSB/conf:/home/ldy/src/YCSB/core/target/core-0.17.0.jar:/home/ldy/src/YCSB/rocksdb/target/rocksdb-binding-0.17.0.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.4.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/rocksdbjni-5.11.3.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -P ../../../YCSB/LDY_bound_setting/cpu_bound_run.properties -p rocksdb.dir=/mnt/test -p rocksdb.optionsfile=../../../YCSB/LDY_bound_setting/cpu_bound.ini
Command line: -t -db site.ycsb.db.rocksdb.RocksDBClient -P ../../../YCSB/LDY_bound_setting/cpu_bound_run.properties -p rocksdb.dir=/mnt/test -p rocksdb.optionsfile=../../../YCSB/LDY_bound_setting/cpu_bound.ini
YCSB Client 0.17.0

Loading workload...
Starting test.
[Thread-1] INFO site.ycsb.db.rocksdb.RocksDBClient - RocksDB data dir: /mnt/test
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[OVERALL], RunTime(ms), 99930
[OVERALL], Throughput(ops/sec), 8005.603922745922
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 96
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.09606724707295107
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 96
[TOTAL_GC_TIME_%], Time(%), 0.09606724707295107
[READ], Operations, 399879
[READ], AverageLatency(us), 68.4113319279082
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 16687
[READ], 95thPercentileLatency(us), 156
[READ], 99thPercentileLatency(us), 350
[READ], Return=OK, 399879
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 185920.0
[CLEANUP], MinLatency(us), 185856
[CLEANUP], MaxLatency(us), 185983
[CLEANUP], 95thPercentileLatency(us), 185983
[CLEANUP], 99thPercentileLatency(us), 185983
[UPDATE], Operations, 400121
[UPDATE], AverageLatency(us), 173.64068619242678
[UPDATE], MinLatency(us), 47
[UPDATE], MaxLatency(us), 138495
[UPDATE], 95thPercentileLatency(us), 284
[UPDATE], 99thPercentileLatency(us), 1116
[UPDATE], Return=OK, 400121